In [1]:
import numpy as np
import pandas as pd

In [11]:
df=pd.read_csv("C:\\Users\\KIIT\\Desktop\\2d.csv")

In [8]:
pd

In [9]:
pd

In [12]:
import numpy as np
import pandas as pd

In [13]:
df=pd.read_csv("C:\\Users\\KIIT\\Desktop\\2d.csv")

In [14]:
df

    ID     Name Department  Salary Active
0  1.0    Vidhi         IT   25000    Yes
1  2.0   Rajesh      Sales   22000    Yes
2  3.0  Shivani      Sales   24000     No
3  4.0    Javed       Ecom   21000    Yes
4  5.0     Aman   Analysis   20000    Yes
5  6.0    Alice         HR   22000     No
6  7.0   Raghav   Security   17000    Yes
7  NaN    Tejas        NaN   25000    NaN

In [15]:
df.interpolate() #predicts the missing int value, only integer values

    ID     Name Department  Salary Active
0  1.0    Vidhi         IT   25000    Yes
1  2.0   Rajesh      Sales   22000    Yes
2  3.0  Shivani      Sales   24000     No
3  4.0    Javed       Ecom   21000    Yes
4  5.0     Aman   Analysis   20000    Yes
5  6.0    Alice         HR   22000     No
6  7.0   Raghav   Security   17000    Yes
7  7.0    Tejas        NaN   25000    NaN